Repository: Armand-Duval/VocabFlow
Catalog: Shared/Localization/Localizable.xcstrings
Source language: en
Languages: zh_hans

# review.daily.preferences.footer
source: Default: a deep or romantic historical line for this season — not limited to Western verse. Keywords only narrow language or form. After saving, today's line regenerates.
zh_hans: 默认是有深度或浪漫的历史原文，按时令推送，不限定西诗。关键词只用来收窄语言或文体。保存后会重生成今日一句。

# review.daily.preferences.limit
source: Up to 3 keywords, 8 characters each.
zh_hans: 最多 3 个词，每个不超过 8 字。

# review.daily.preferences.link
source: Preferences
zh_hans: 偏好

# review.daily.preferences.placeholder
source: Keyword
zh_hans: 输入关键词

# review.daily.preferences.presets
source: Quick tags
zh_hans: 快捷标签

# review.daily.preferences.save
source: Save
zh_hans: 保存

# review.daily.preferences.title
source: Daily line preferences
zh_hans: 今日一句偏好

# review.daily.refresh
source: Refresh today’s line
zh_hans: 刷新今日一句

# review.daily.timely
source: For the season
zh_hans: 合时宜

# review.daily.title
source: A line for today
zh_hans: 今日一句

# review.deckFilter.all
source: All decks
zh_hans: 全部词库

# review.empty.assistant
source: Nothing here yet. Paste a line from what you’re reading — I’ll help turn it into cards you can review.
zh_hans: 这里还空着。读到想留住的句子时，贴过来，我帮你整理成可复习的卡片。

# review.empty.done
source: You're done for now. Open Library to study any card.
zh_hans: 今天的卡片都复习完了。可以去「词库」点卡片继续学习。

# review.empty.goCreate
source: Go to Create tab to paste text or use OCR and save your first cards.
zh_hans: 前往「制卡」粘贴文本或拍照识别，生成并保存第一张卡片。

# review.empty.noCards
source: Create and save cards first.
zh_hans: 先去「制卡」生成并保存卡片。

# review.empty.startCreate
source: Start with a sentence
zh_hans: 从一句话开始

# review.empty.title
source: Nothing to review
zh_hans: 暂无待复习

# review.home.activityRecent
source: Last %1$lld days: %2$lld words · %3$lld lines
zh_hans: 近 %1$lld 天温习了 %2$lld 个词 · %3$lld 句

# review.home.activityToday
source: Today you revisited %1$lld words · %2$lld lines
zh_hans: 今天温习了 %1$lld 个词 · %2$lld 句

# review.home.back
source: Back to home
zh_hans: 回到首页

# review.home.continueDeck
source: Continue: %@
zh_hans: 续上：%@

# review.home.doneHint
source: When a line sticks with you later, you can tuck it away anytime.
zh_hans: 之后读到想留住的句子，随时收录就好。

# review.home.doneOffer
source: Add a card
zh_hans: 顺便加一张卡

# review.home.doneToday
source: That’s enough for today
zh_hans: 今天的份，先到这里

# review.home.dueCount
source: %lld cards due today
zh_hans: 今天 %lld 张待复习

# review.home.lifetimeStudied
source: Cards studied
zh_hans: 累计背过

# review.home.quickCapture
source: Quick capture
zh_hans: 快速收录

# review.home.quotaLink
source: Today's quota
zh_hans: 今日配额

# review.home.recentDecks
source: Recent decks
zh_hans: 最近词库

# review.home.start
source: Start Review
zh_hans: 开始复习

# review.home.startDone
source: Done for today
zh_hans: 今日复习完成

# review.home.statsCaptured
source: Captured
zh_hans: 今日收录

# review.home.statsNew
source: New
zh_hans: 新学

# review.home.statsReview
source: Review
zh_hans: 复习

# review.home.statsTitle
source: Today
zh_hans: 今日

# review.home.statsTotal
source: Studied
zh_hans: 已学

# review.home.studiedToday
source: Studied today %lld
zh_hans: 今日已学 %lld

# review.home.totalCards
source: Total cards
zh_hans: 总卡片

# review.home.weekActivity
source: This week %lld words · %lld lines
zh_hans: 本周 %lld 词 · %lld 句

# review.learning.wait.message
source: Next card in %@
zh_hans: 下一张将在 %@ 后出现

# review.learning.wait.title
source: Review again soon
zh_hans: 稍后再复习

# review.meaning
source: Meaning
zh_hans: 释义

# review.noCards
source: No cards to review
zh_hans: 没有可复习的卡片

# review.paraphrases
source: Model sentences
zh_hans: 仿写例句

# review.quota.detail.deferred
source: %d cards deferred by quota
zh_hans: 另有 %d 张因配额未排入

# review.quota.detail.deferredMessage
source: %d due cards are waiting. Raise limits in Settings or continue tomorrow.
zh_hans: 还有 %d 张到期卡片在排队。可在设置中提高配额，或明天继续。

# review.quota.detail.hint
source: Daily counts reset at midnight. A limit of 0 means unlimited.
zh_hans: 每日计数在零点重置。配额设为 0 表示不限。

# review.quota.detail.title
source: Daily Quota
zh_hans: 今日配额

# review.quota.detail.today
source: Today's Progress
zh_hans: 今日进度

# review.quota.newLabel
source: New
zh_hans: 新词

# review.quota.reached.message
source: %d cards left for later.
zh_hans: 还有 %d 张待复习，明天继续。

# review.quota.reached.title
source: Daily limit reached
zh_hans: 今日配额已满

# review.quota.reviewLabel
source: Review
zh_hans: 复习

# review.quota.unlimited
source: Unlimited
zh_hans: 不限

# review.rating.hint
source: Numbers show when this card will appear again
zh_hans: 数字表示选择后该卡再次出现的时间

# review.relatedWords
source: Synonyms / antonyms
zh_hans: 同义 / 反义

# review.reminder.body
source: You have %d cards due for review
zh_hans: 你有 %d 张卡片待复习

# review.rootsSource
source: Roots / source
zh_hans: 词根 / 出处

# review.scrollForAnswer
source: Scroll for meaning & translation
zh_hans: 下滑查看释义与翻译

# review.session.done
source: Done
zh_hans: 完成

# review.showAnswer
source: Show answer
zh_hans: 显示答案

# review.study
source: Study
zh_hans: 学习

# review.swipe.hint
source: Swipe left Forgot · right Easy · tap Fuzzy
zh_hans: 左滑忘记 · 右滑很熟 · 点按模糊

# review.swipeCoach.again
source: Swipe left: Forgot
zh_hans: 左滑：忘记

# review.swipeCoach.easy
source: Swipe right: Easy
zh_hans: 右滑：很熟

# review.swipeCoach.good
source: Tap Fuzzy in the bottom bar
zh_hans: 模糊请点底部按钮

# review.swipeCoach.gotIt
source: Got it
zh_hans: 知道了

# review.swipeCoach.reveal
source: Swipe down to reveal the answer
zh_hans: 下滑查看答案

# review.swipeCoach.title
source: Review gestures
zh_hans: 复习手势

# review.tapFlipBack
source: Tap to flip back · scroll if content is long
zh_hans: 点击卡片可翻回正面 · 内容过长可上下滑动

# review.tapReveal
source: Tap the card to reveal the answer
zh_hans: 点击卡片查看答案

# review.title
source: Review
zh_hans: 复习

# review.translation
source: Translation
zh_hans: 译文

# settings.about.section
source: About
zh_hans: 关于

# settings.aboutSupport.section
source: About & support
zh_hans: 关于与支持

# settings.ai.customBaseURL.footer
source: OpenAI-compatible base URL ending with /v1
zh_hans: 兼容 OpenAI 的 Base URL，以 /v1 结尾

# settings.ai.customBaseURL.missing
source: Custom provider requires a Base URL
zh_hans: 自定义接口需要填写 Base URL

# settings.ai.customModel.footer
source: Optional. Overrides the model picker when set.
zh_hans: 可选。填写后优先使用此模型 ID

# settings.ai.customModel.placeholder
source: Custom model ID (optional)
zh_hans: 自定义模型 ID（可选）

# settings.ai.keyFooter
source: Leave blank to use the built-in key. Your own key only affects AI billing — import/export and advanced features may still require membership later.
zh_hans: 留空则使用内置 Key。自备 Key 仅免除 AI 调用扣费，导入导出等高级功能后续仍可能需会员。

# settings.ai.model.custom
source: Use the model ID from your provider
zh_hans: 使用你的接口提供的模型 ID

# settings.ai.model.deepseek.chat
source: DeepSeek Chat — fast and capable
zh_hans: DeepSeek Chat — 速度快、能力强

# settings.ai.model.deepseek.reasoner
source: DeepSeek Reasoner — stronger reasoning
zh_hans: DeepSeek Reasoner — 更强推理

# settings.ai.model.openai.4o
source: GPT-4o — higher quality
zh_hans: GPT-4o — 更高质量

# settings.ai.model.openai.4oMini
source: GPT-4o mini — good balance
zh_hans: GPT-4o mini — 性价比高

# settings.ai.model.openrouter
source: Routed via OpenRouter
zh_hans: 通过 OpenRouter 路由

# settings.ai.modelName.placeholder
source: Model name (default %@)
zh_hans: 模型名称（默认%@）

# settings.ai.provider
source: AI Provider
zh_hans: AI 服务商

# settings.ai.provider.custom
source: Custom (OpenAI-compatible)
zh_hans: 自定义（OpenAI 兼容）

# settings.ai.section
source: AI model
zh_hans: AI 模型配置

# settings.ai.section.compact
source: AI model
zh_hans: AI 模型配置

# settings.apiKey.footer
source: Your key takes priority. Leave empty to use KnoWell's official server.
zh_hans: 填写你自己的 Key 会优先直连；留空则使用致知官方服务。

# settings.apiKey.placeholder
source: Leave empty to use default key
zh_hans: 留空则使用默认 Key

# settings.apkg.export
source: Export Anki Package (.apkg)
zh_hans: 导出 Anki 包 (.apkg)

# settings.appLog.export
source: Export all logs
zh_hans: 一键导出全部日志

# settings.appLog.exportEmpty
source: No log file yet. Open the app or share something to KnoWell first.
zh_hans: 还没有日志。先打开一次致知，或分享一次到致知，再来导出。

# settings.appLog.footer
source: Each process writes its own file (knowell-*.log, share-*.log, action-*.log). One tap shares every file.
zh_hans: 主程序、分享、Action 各写各的文件，不会拼成一份。点一下即可导出全部日志文件。

# settings.backup.export
source: Export backup
zh_hans: 导出备份

# settings.backup.footer
source: Export JSON for AirDrop, Files, or device migration. Free developer accounts don't include iCloud sync. Current library: %lld cards.
zh_hans: 导出为 JSON 文件，可通过 AirDrop、文件 App 保存或换机恢复。个人免费开发者账号不支持 iCloud，请用备份文件在多设备间同步。当前词库：%lld 张卡片。

# settings.backup.import
source: Import backup
zh_hans: 导入备份

# settings.backup.section
source: Backup
zh_hans: 数据备份

# settings.backupReminder.enabled
source: Backup reminder
zh_hans: 备份提醒

# settings.backupReminder.footer
source: Receive a local notification if you haven't exported a backup in 7 days.
zh_hans: 若超过 7 天未导出备份，将收到本地通知提醒。

# settings.dailyAutoBackup.enabled
source: Daily auto backup
zh_hans: 每日自动备份

# settings.dailyAutoBackup.footer
source: Daily auto backup after midnight. Find files in the Files app under KnoWell.
zh_hans: 每日零点自动备份卡片数据，可在系统「文件」App 的 KnoWell 文件夹查看。

# settings.data.footer
source: %d cards in library. JSON backup keeps full SRS data; .apkg exports for Anki (Basic note type).
zh_hans: 词库共 %d 张卡。JSON 备份保留完整复习数据；.apkg 可导入 Anki（Basic 模板）。

# settings.data.section
source: Data
zh_hans: 数据

# settings.dataManagement.section
source: Card data
zh_hans: 卡片数据管理

# settings.deleteAllCards
source: Delete All Cards
zh_hans: 删除全部卡片

# settings.deleteAllCards.done
source: Library Cleared
zh_hans: 词库已清空

# settings.deleteAllCards.doneMessage
source: All cards have been deleted.
zh_hans: 全部卡片已删除。

# settings.deleteAllCards.message
source: This permanently removes every card in your library.
zh_hans: 将永久删除词库中的全部卡片。

# settings.export.failed
source: Export failed
zh_hans: 导出失败

# settings.exportBackup.success
source: Backup ready to export
zh_hans: 备份已准备好导出

# settings.help.apkg
source: Anki sync: import .apkg decks from Decks page, review in KnoWell, export .apkg back to AnkiMobile via Files or AirDrop.
zh_hans: Anki 同步：在「词库包」导入 .apkg，在 KnoWell 复习，再通过文件/AirDrop 导出 .apkg 到 AnkiMobile。

# settings.help.byok
source: BYOK: enter your Moonshot/Kimi API key in AI settings. It saves AI quota charges but does not unlock paid features by itself.
zh_hans: 自备 Key：在 AI 设置中填写 Moonshot/Kimi API Key，可免除 AI 点数消耗，但不等同于会员权限。

# settings.help.share
source: Share extension: share text from Safari or Books to KnoWell. Clipboard import works when you open the app after copying.
zh_hans: 分享扩展：从 Safari、图书等分享文本到 KnoWell。复制后打开 App 也会提示剪贴板导入。

# settings.help.title
source: Help & FAQ
zh_hans: 帮助与常见问题

# settings.import.complete
source: Import complete
zh_hans: 导入完成

# settings.import.copy.footer
source: These apps don't expose the system share sheet to third-party extensions. Copy text and open KnoWell to create cards.
zh_hans: 这些 App 不使用 iOS 系统分享，第三方扩展无法出现在菜单里。这是 App 和系统的限制，不是 KnoWell 的配置问题。拷贝后打开本 App 即可制卡。

# settings.import.copy.section
source: Use copy & open
zh_hans: 请用拷贝导入

# settings.import.copy.step1
source: Apple Books, domestic reader apps
zh_hans: Apple Books、番茄小说等

# settings.import.copy.step2
source: Select text → Copy
zh_hans: 选中文字 → 点「拷贝」

# settings.import.copy.step3
source: Open KnoWell → auto-fill
zh_hans: 打开 KnoWell → 自动填入

# settings.import.failed
source: Import failed
zh_hans: 导入失败

# settings.import.formatsFooter
source: Supports Anki .apkg, JSON backup, and share/clipboard text import.
zh_hans: 支持 Anki .apkg、JSON 备份，以及分享/剪贴板文本导入。

# settings.import.help
source: Import from other apps
zh_hans: 从其他 App 导入

# settings.import.mergeResult
source: Added %1$lld, updated %2$lld cards.
zh_hans: 新增 %1$lld 张，更新 %2$lld 张。

# settings.import.replaceResult
source: Replaced library with %lld cards.
zh_hans: 已替换为 %lld 张卡片。

# settings.import.section
source: Import Methods
zh_hans: 导入方式

# settings.import.share.section
source: Share import supported
zh_hans: 支持分享导入

# settings.import.share.step1
source: Safari, Notes
zh_hans: Safari、备忘录

# settings.import.share.step2
source: Choose KnoWell — opens the same Create screen
zh_hans: 分享面板选致知，进入与 App 相同的制卡页

# settings.importExport.section
source: Import & Export
zh_hans: 导入与导出

# settings.importMode.merge
source: Merge (keep existing cards)
zh_hans: 合并导入（保留现有卡片）

# settings.importMode.message
source: Merge updates matching IDs and appends new cards. Replace clears the library first.
zh_hans: 合并：同 ID 更新，新卡片追加。替换：清空现有词库后导入。

# settings.importMode.replace
source: Replace all
zh_hans: 替换全部

# settings.importMode.title
source: Choose import mode
zh_hans: 选择导入方式

# settings.key.cloud
source: Using KnoWell official server
zh_hans: 使用致知官方服务

# settings.key.default
source: Using built-in default key
zh_hans: 使用内置默认 Key

# settings.key.missing
source: API key not configured
zh_hans: 未配置 API Key

# settings.key.user
source: Using your API key
zh_hans: 使用你的 API Key

# settings.maintenance.footer
source: Import, export, and deck downloads are in Library → Decks (books icon).
zh_hans: 词库下载、导入与备份导出请前往词库页（Library 右上角书本图标）。

# settings.maintenance.section
source: Maintenance
zh_hans: 数据维护

# settings.migrateCards
source: Upgrade Card Content
zh_hans: 整理旧卡片内容

# settings.migrateCards.alreadyQueued
source: A card upgrade is already in the queue.
zh_hans: 已有整理任务在队列中

# settings.migrateCards.done
source: Cards Upgraded
zh_hans: 整理完成

# settings.migrateCards.doneMessage
source: Fronts updated: %lld Backs split: %lld Phonetics filled: %lld Sources filled: %lld Content refreshed: %lld AI failures: %lld
zh_hans: 正面已更新：%lld 背面已拆分：%lld 音标已补全：%lld 出处已补全：%lld 内容已按新规则刷新：%lld AI 失败：%lld

# settings.migrateCards.message
source: Re-run the same latest AI card rules used for new cards (sense, translation with 【marks】, phonetics, source, etc.). Review progress and decks are kept. Future fields follow the generator automatically.
zh_hans: 用与「新建卡片」相同的最新 AI 规则重生成内容（释义、翻译【标注】、音标、出处等），复习进度与牌组保留。后续新字段会随制卡规则自动生效。

# settings.migrateCards.nothingToDo
source: No cards need upgrading right now.
zh_hans: 当前没有需要整理的卡片

# settings.migrateCards.queued
source: Card upgrade added to the generation queue. Track progress on the Create tab.
zh_hans: 整理旧卡片已加入生成队列，可在制卡页查看进度

# settings.migrateCards.running
source: Upgrading cards…
zh_hans: 正在整理卡片…

# settings.model
source: Model
zh_hans: 模型

# settings.model.8k.detail
source: 8K context · fast · best for short sentences and small word lists
zh_hans: 8K 上下文 · 速度快 · 适合短句和少量生词

# settings.model.32k.detail
source: 32K context · better for long passages
zh_hans: 32K 上下文 · 适合较长段落

# settings.model.default.detail
source: Model details unavailable
zh_hans: 暂无该模型说明

# settings.model.k2.detail
source: K2.5 · stronger reasoning for nuanced definitions
zh_hans: K2.5 · 释义更准确，适合精读

# settings.model.k26.detail
source: K2.6 · latest Kimi model, higher quality cards
zh_hans: K2.6 · 最新 Kimi 模型，制卡质量更高

# settings.openDeckStore
source: Decks, backup & Anki import
zh_hans: 词库包、备份与 Anki 导入

# settings.read.failed
source: Read failed
zh_hans: 读取失败

# settings.resetAllSRS
source: Reset All Review Progress
zh_hans: 重置全部复习进度

# settings.resetAllSRS.done
source: Progress Reset
zh_hans: 已重置进度

# settings.resetAllSRS.doneMessage
source: All cards are now treated as new.
zh_hans: 全部卡片已恢复为新卡状态。

# settings.resetAllSRS.message
source: All cards will become new. Card content is kept.
zh_hans: 所有卡片将恢复为新卡，内容不会删除。

# settings.review.footer
source: Set to Unlimited to remove a cap. Quotas reset at midnight.
zh_hans: 设为「不限」可关闭对应上限。配额每天零点重置。

# settings.review.newLimit
source: New cards per day
zh_hans: 每日新词

# settings.review.reminder.enabled
source: Daily review reminder
zh_hans: 每日复习提醒

# settings.review.reminder.time
source: Reminder time
zh_hans: 提醒时间

# settings.review.revealStyle
source: Card reveal
zh_hans: 卡片揭晓方式

# settings.review.revealStyle.flip
source: Flip
zh_hans: 翻转

# settings.review.revealStyle.flipFooter
source: Flip to show prompt and meaning.
zh_hans: 翻转后看题干与释义。

# settings.review.revealStyle.reveal
source: Expand
zh_hans: 揭晓

# settings.review.revealStyle.revealFooter
source: Reveal the answer below the prompt.
zh_hans: 在题干下方展开答案。

# settings.review.reviewLimit
source: Reviews per day
zh_hans: 每日复习

# settings.review.section
source: Review limits
zh_hans: 复习配额

# settings.review.unlimited
source: Unlimited review
zh_hans: 无限复习

# settings.save
source: Save settings
zh_hans: 保存设置

# settings.saved.title
source: Saved
zh_hans: 已保存

# settings.status
source: Status
zh_hans: 当前状态

# settings.status.missing
source: API key missing — card generation unavailable
zh_hans: 未配置 API Key，无法制卡

# settings.status.ready
source: AI card generation is available
zh_hans: 可以正常使用 AI 制卡

# settings.testAPI
source: Test connection
zh_hans: 测试连通

# settings.testAPI.failed
source: Connection failed: %@
zh_hans: 连接失败：%@

# settings.testAPI.success
source: Connection successful. Your API key works.
zh_hans: 连接成功，API Key 可用。

# settings.testAPI.testing
source: Testing…
zh_hans: 测试中…

# settings.testAPI.title
source: API Connection
zh_hans: API 连通性

# settings.theme.footer
source: Accent only. Paper and review rating colors stay the same.
zh_hans: 只换强调色。纸面和学习对错色不变。

# settings.theme.inkIndigo
source: Indigo
zh_hans: 靛蓝

# settings.theme.inkTeal
source: Ink teal
zh_hans: 黛青

# settings.theme.inkViolet
source: Ink violet
zh_hans: 墨紫

# settings.theme.title
source: Theme color
zh_hans: 主题色

# settings.title
source: Settings
zh_hans: 设置

# speech.sentence
source: Speak sentence
zh_hans: 朗读原句

# speech.word
source: Speak word
zh_hans: 朗读单词

# study.selection.createCard
source: Create card
zh_hans: 建卡

# study.selection.highlightUpdated
source: Highlight updated
zh_hans: 已更新高亮

# study.selection.hint
source: Select text for Look Up, Set highlight, or Create card.
zh_hans: 选中文字可查词、设为高亮或建卡。

# study.selection.lookup
source: Look Up
zh_hans: 查词

# study.selection.lookupUnavailable
source: No dictionary entry for this term.
zh_hans: 系统词库中没有该词释义。

# study.selection.setHighlight
source: Set highlight
zh_hans: 设为高亮

# tab.create
source: Create
zh_hans: 制卡

# tab.library
source: Library
zh_hans: 词库

# tab.review
source: Review
zh_hans: 复习

# tab.settings
source: Me
zh_hans: 我的

# words.added
source: Added "%@"
zh_hans: 已加入「%@」

# words.addToVocabulary
source: Add to vocabulary
zh_hans: 加入生词

# words.duplicate
source: "%@" is already in the list
zh_hans: 「%@」已在生词列表中

# words.emptyHint
source: Select text above or type a word below
zh_hans: 拖选原文加入，或在下方手动输入

# words.existsInDeck
source: "%@" already has this sentence in the selected deck
zh_hans: 「%@」在该词库中已有此句卡片

# words.manualPlaceholder
source: Add word
zh_hans: 添加生词

# words.selectionEmpty
source: Selection is empty
zh_hans: 选区为空
